content/posts/my_hyprland_config.org
#+title: My Hyprland Config
#+AUTHOR: Javier Pacheco
#+DESCRIPTION: My Hyprland configuration


#+BEGIN_PREVIEW
Hello, in this post I'm going to share and explain a little bit my =Hyprland= configuration, I'm not an expert in this window manager, but I really like it, I think this WM have a great future, and for me, this one is the best out there, of course there are some more, more solids if you will, but this is awesome.
#+END_PREVIEW


* My hyprland configuration.
My =Hyprland= configuration is split in multiple files for readable and a better understanding comprehension to me.

#+begin_src example
./
├── hyprland.conf*
├── pyprland.toml
└── src/
    ├── env.conf*
    ├── init.conf*
    ├── general.conf*
    ├── keybinds.conf*
    ├── scratchpads.conf
    └── windowrules.conf
#+end_src

** hyprland.conf
This is the main =hyprland= configuration file, this file will source every single file in the src folder.
 
#+begin_src conf
# [[ Javier Hyprland configuration ]]

source = ~/.config/hypr/src/init.conf
source = ~/.config/hypr/src/general.conf
source = ~/.config/hypr/src/env.conf
source = ~/.config/hypr/src/keybinds.conf
source = ~/.config/hypr/src/scratchpads.conf
#+end_src

** init.conf

#+begin_src conf
# Prgrams that I run when Hyprland starts.

exec-once = pypr
# exec-once = swww init
exec-once = cron -f ~/.config/cron/cron.conf
exec-once = waybar
exec-once = mpd --no-daemon "$HOME"/.config/mpd/mpd.conf
exec-once = pipewire
exec-once = pipewire-pulse
exec-once = wireplumber
exec-once = foot --server
exec-once = swayidle -w timeout 500 'swaylock' 
exec-once = xrdb ~/.config/.Xdefaults

#+end_src

** general.conf
This file contains the monitor, keyboard, mouse, effects configuration.

*** general.
#+begin_src conf
general {
    gaps_in = 5
    gaps_out = 10
    border_size = 2
    no_border_on_floating = 0
    col.active_border = rgba(999999bb)
    col.inactive_border = rgba(595959aa)
    layout = master
    allow_tearing = false
    cursor_inactive_timeout = 2
    resize_corner = 3
}

#+end_src

*** input
#+begin_src conf
input {
    kb_layout = gb,us
    kb_options=grp:win_space_toggle 
    kb_variant = 
    kb_model =
    numlock_by_default = true
    kb_options = ctrl:nocaps
    kb_rules =

    follow_mouse = 1

    touchpad {
        natural_scroll = no
    }

    sensitivity = 0 # -1.0 - 1.0, 0 means no modification.
}

#+end_src

*** decorations
#+begin_src conf
decoration {
    rounding = 0
    blur {
    size = 1
    passes = 2
    new_optimizations = true
    xray = false
    ignore_opacity = true
    }

    drop_shadow = no
    shadow_range = 4
    shadow_render_power = 3
    col.shadow = rgba(1a1a1aee)
    blurls = waybar
}
  
#+end_src

*** Animations
#+begin_src conf
animations {
    enabled = no
    # bezier = myBezier, 0.05, 0.9, 0.1, 1.05
    # animation = windows, 1, 7, myBezier
    # animation = windowsOut, 1, 7, default, popin 80%
    # animation = border, 1, 10, default
    # animation = borderangle, 1, 8, default
    # animation = fade, 1, 7, default
    # animation = workspaces, 1, 6, default
    animation=windows,1,8,default,popin 20%
}
  
#+end_src

*** misc 
#+begin_src conf
misc {
    # See https:/wiki.hyprland.org/.configuring/Variables/ for more
    force_default_wallpaper = 0 
    focus_on_activate = 1
    enable_swallow = 1
    swallow_regex = ^(Alacritty|foot|footclient)$
}
  
#+end_src

*** dwindle 
#+begin_src conf
dwindle {
    # See https:/wiki.hyprland.org/.configuring/Dwindle-Layout/ for more
    pseudotile = yes # master switch for pseudotiling. Enabling is bound to mainMod + P in the keybinds section below
    preserve_split = yes # you probably want this
}
  
#+end_src

*** master 
#+begin_src conf
master {
    new_is_master = false
    drop_at_cursor = false
}

#+end_src

