posts/my_hyprland_config.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Hyprland Config</title>
<meta name="description" content="My Hyprland configuration" />
<meta name="generator" content="Org Mode" />
<!-- <link rel="stylesheet" type="text/css" href="/ox.css"/> -->
<link rel="stylesheet" type="text/css" href="/custom.css"/>
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=JetBrains+Mono" rel="stylesheet">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css">
<!-- copy org-blocks to clipboard  -->
</head>
<body>
<div id="preamble" class="status">
<hr style="border-top: 1px solid black;">
<div class='topnav' style='display: flex; justify-content: space-between; align-items: center;'>
  <h2 style='margin-top: 0; margin-bottom: 0; margin-left:0px;'>Javier Pacheco</h2> 
  <div>
    <a href='/index.html' style='font-weight:bold;'>Home</a> |
    <a href='/archive.html' style='font-weight:bold;'>Blog</a> | 
    <a href='/about.html' style='font-weight:bold;'>About Me</a> | 
  </div>
</div>
<hr style="border-top: 1px solid black;">
</div>
<div id="content" class="content">
<header>
<h1 class="title">My Hyprland Config</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2da5965">My hyprland configuration.</a>
<ul>
<li><a href="#org7dacc59">hyprland.conf</a></li>
<li><a href="#org513b5a3">init.conf</a></li>
<li><a href="#orgec3b311">general.conf</a>
<ul>
<li><a href="#orgb397e89">general.</a></li>
<li><a href="#orge16479b">input</a></li>
<li><a href="#orgaad4531">decorations</a></li>
<li><a href="#orga9e9937">Animations</a></li>
<li><a href="#org10dc696">misc</a></li>
<li><a href="#org3149657">dwindle</a></li>
<li><a href="#org0a48cd8">master</a></li>
<li><a href="#org27c8e1e">gestures</a></li>
</ul>
</li>
<li><a href="#orgc36275b">env.conf</a></li>
<li><a href="#orgf632970">keybinds.conf</a>
<ul>
<li><a href="#org0f96712">Main and most useful keybinds</a></li>
<li><a href="#org3494880">Keychords.</a></li>
<li><a href="#org302b9d5">Window management.</a></li>
<li><a href="#org24cf377">Media Keys</a></li>
</ul>
</li>
<li><a href="#org4172984">scratchpads.conf</a>
<ul>
<li><a href="#org85b44ba">Pyprland</a></li>
<li><a href="#org877beed">keybinds and rules.</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</nav>
<p>

</p>

<div class="PREVIEW" id="org0afe53e">
<p>
Hello, in this post I'm going to share and explain a little bit my <code>Hyprland</code> configuration, I'm not an expert in this window manager, but I really like it, I think this WM have a great future, and for me, this one is the best out there, of course there are some more, more solids if you will, but this is awesome.
</p>

</div>


<div id="outline-container-org2da5965" class="outline-2">
<h2 id="org2da5965">My hyprland configuration.</h2>
<div class="outline-text-2" id="text-org2da5965">
<p>
My <code>Hyprland</code> configuration is split in multiple files for readable and a better understanding comprehension to me.
</p>

<div class="org-src-container">
<pre class="src src-example">./
├── hyprland.conf*
├── pyprland.toml
└── src/
    ├── env.conf*
    ├── init.conf*
    ├── general.conf*
    ├── keybinds.conf*
    ├── scratchpads.conf
    └── windowrules.conf
</pre>
</div>
</div>

<div id="outline-container-org7dacc59" class="outline-3">
<h3 id="org7dacc59">hyprland.conf</h3>
<div class="outline-text-3" id="text-org7dacc59">
<p>
This is the main <code>hyprland</code> configuration file, this file will source every single file in the src folder.
</p>

<div class="org-src-container">
<pre class="src src-conf"><span class="org-comment-delimiter"># </span><span class="org-comment">[[ Javier Hyprland configuration ]]</span>

<span class="org-variable-name">source</span> = ~/.config/hypr/src/init.conf
<span class="org-variable-name">source</span> = ~/.config/hypr/src/general.conf
<span class="org-variable-name">source</span> = ~/.config/hypr/src/env.conf
<span class="org-variable-name">source</span> = ~/.config/hypr/src/keybinds.conf
<span class="org-variable-name">source</span> = ~/.config/hypr/src/scratchpads.conf
</pre>
</div>
</div>
</div>

<div id="outline-container-org513b5a3" class="outline-3">
<h3 id="org513b5a3">init.conf</h3>
<div class="outline-text-3" id="text-org513b5a3">
<div class="org-src-container">
<pre class="src src-conf"><span class="org-comment-delimiter"># </span><span class="org-comment">Prgrams that I run when Hyprland starts.</span>

<span class="org-variable-name">exec-once</span> = pypr
<span class="org-comment-delimiter"># </span><span class="org-comment">exec-once = swww init</span>
<span class="org-variable-name">exec-once</span> = cron -f ~/.config/cron/cron.conf
<span class="org-variable-name">exec-once</span> = waybar
<span class="org-variable-name">exec-once</span> = mpd --no-daemon <span class="org-string">"$HOME"</span>/.config/mpd/mpd.conf
<span class="org-variable-name">exec-once</span> = pipewire
<span class="org-variable-name">exec-once</span> = pipewire-pulse
<span class="org-variable-name">exec-once</span> = wireplumber
<span class="org-variable-name">exec-once</span> = foot --server
<span class="org-variable-name">exec-once</span> = swayidle -w timeout 500 <span class="org-string">'swaylock'</span> 
<span class="org-variable-name">exec-once</span> = xrdb ~/.config/.Xdefaults

</pre>
</div>
</div>
</div>

<div id="outline-container-orgec3b311" class="outline-3">
<h3 id="orgec3b311">general.conf</h3>
<div class="outline-text-3" id="text-orgec3b311">
<p>
This file contains the monitor, keyboard, mouse, effects configuration.
</p>
</div>

<div id="outline-container-orgb397e89" class="outline-4">
<h4 id="orgb397e89">general.</h4>
<div class="outline-text-4" id="text-orgb397e89">
<div class="org-src-container">
<pre class="src src-conf"><span class="org-type">general</span> {
    <span class="org-variable-name">gaps_in</span> = 5
    <span class="org-variable-name">gaps_out</span> = 10
    <span class="org-variable-name">border_size</span> = 2
    <span class="org-variable-name">no_border_on_floating</span> = 0
    <span class="org-variable-name">col.active_border</span> = rgba(999999bb)
    <span class="org-variable-name">col.inactive_border</span> = rgba(595959aa)
    <span class="org-variable-name">layout</span> = master
    <span class="org-variable-name">allow_tearing</span> = false
    <span class="org-variable-name">cursor_inactive_timeout</span> = 2
    <span class="org-variable-name">resize_corner</span> = 3
}

</pre>
</div>
</div>
</div>

<div id="outline-container-orge16479b" class="outline-4">
<h4 id="orge16479b">input</h4>
<div class="outline-text-4" id="text-orge16479b">
<div class="org-src-container">
<pre class="src src-conf"><span class="org-type">input</span> {
    <span class="org-variable-name">kb_layout</span> = gb,us
    <span class="org-variable-name">kb_options</span>=grp:win_space_toggle 
    <span class="org-variable-name">kb_variant</span> = 
    <span class="org-variable-name">kb_model</span> =
    <span class="org-variable-name">numlock_by_default</span> = true
    <span class="org-variable-name">kb_options</span> = ctrl:nocaps
    <span class="org-variable-name">kb_rules</span> =

    <span class="org-variable-name">follow_mouse</span> = 1

    <span class="org-type">touchpad</span> {
        <span class="org-variable-name">natural_scroll</span> = no
    }

    <span class="org-variable-name">sensitivity</span> = 0 <span class="org-comment-delimiter"># </span><span class="org-comment">-1.0 - 1.0, 0 means no modification.</span>
}

</pre>
</div>
</div>
</div>

<div id="outline-container-orgaad4531" class="outline-4">
<h4 id="orgaad4531">decorations</h4>
<div class="outline-text-4" id="text-orgaad4531">
<div class="org-src-container">
<pre class="src src-conf"><span class="org-type">decoration</span> {
    <span class="org-variable-name">rounding</span> = 0
    <span class="org-type">blur</span> {
    <span class="org-variable-name">size</span> = 1
    <span class="org-variable-name">passes</span> = 2
    <span class="org-variable-name">new_optimizations</span> = true
    <span class="org-variable-name">xray</span> = false
    <span class="org-variable-name">ignore_opacity</span> = true
    }

    <span class="org-variable-name">drop_shadow</span> = no
    <span class="org-variable-name">shadow_range</span> = 4
    <span class="org-variable-name">shadow_render_power</span> = 3
    <span class="org-variable-name">col.shadow</span> = rgba(1a1a1aee)
    <span class="org-variable-name">blurls</span> = waybar
}
  
</pre>
</div>
</div>
</div>

<div id="outline-container-orga9e9937" class="outline-4">
<h4 id="orga9e9937">Animations</h4>
<div class="outline-text-4" id="text-orga9e9937">
<div class="org-src-container">
<pre class="src src-conf"><span class="org-type">animations</span> {
    <span class="org-variable-name">enabled</span> = no
    <span class="org-comment-delimiter"># </span><span class="org-comment">bezier = myBezier, 0.05, 0.9, 0.1, 1.05</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">animation = windows, 1, 7, myBezier</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">animation = windowsOut, 1, 7, default, popin 80%</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">animation = border, 1, 10, default</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">animation = borderangle, 1, 8, default</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">animation = fade, 1, 7, default</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">animation = workspaces, 1, 6, default</span>
    <span class="org-variable-name">animation</span>=windows,1,8,default,popin 20%
}
  
</pre>
</div>
</div>
</div>

<div id="outline-container-org10dc696" class="outline-4">
<h4 id="org10dc696">misc</h4>
<div class="outline-text-4" id="text-org10dc696">
<div class="org-src-container">
<pre class="src src-conf"><span class="org-type">misc</span> {
    <span class="org-comment-delimiter"># </span><span class="org-comment">See https:/wiki.hyprland.org/.configuring/Variables/ for more</span>
    <span class="org-variable-name">force_default_wallpaper</span> = 0 
    <span class="org-variable-name">focus_on_activate</span> = 1
    <span class="org-variable-name">enable_swallow</span> = 1
    <span class="org-variable-name">swallow_regex</span> = ^(Alacritty|foot|footclient)$
}
  
</pre>
</div>
</div>
</div>

<div id="outline-container-org3149657" class="outline-4">
<h4 id="org3149657">dwindle</h4>
<div class="outline-text-4" id="text-org3149657">
<div class="org-src-container">
<pre class="src src-conf"><span class="org-type">dwindle</span> {
    <span class="org-comment-delimiter"># </span><span class="org-comment">See https:/wiki.hyprland.org/.configuring/Dwindle-Layout/ for more</span>
    <span class="org-variable-name">pseudotile</span> = yes <span class="org-comment-delimiter"># </span><span class="org-comment">master switch for pseudotiling. Enabling is bound to mainMod + P in the keybinds section below</span>
    <span class="org-variable-name">preserve_split</span> = yes <span class="org-comment-delimiter"># </span><span class="org-comment">you probably want this</span>
}
  
</pre>
</div>
</div>
</div>

<div id="outline-container-org0a48cd8" class="outline-4">
<h4 id="org0a48cd8">master</h4>
<div class="outline-text-4" id="text-org0a48cd8">
<div class="org-src-container">
<pre class="src src-conf"><span class="org-type">master</span> {
    <span class="org-variable-name">new_is_master</span> = false
    <span class="org-variable-name">drop_at_cursor</span> = false
}

</pre>
</div>
</div>
</div>
