posts/my_hyprland_config.html

<div id="outline-container-org27c8e1e" class="outline-4">
<h4 id="org27c8e1e">gestures</h4>
<div class="outline-text-4" id="text-org27c8e1e">
<div class="org-src-container">
<pre class="src src-conf"><span class="org-type">gestures</span> {
    <span class="org-comment-delimiter"># </span><span class="org-comment">See https:/wiki.hyprland.org/.configuring/Variables/ for more</span>
    <span class="org-variable-name">workspace_swipe</span> = 1
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc36275b" class="outline-3">
<h3 id="orgc36275b">env.conf</h3>
<div class="outline-text-3" id="text-orgc36275b">
<div class="org-src-container">
<pre class="src src-conf"><span class="org-comment-delimiter"># </span><span class="org-comment">hyprland env's</span>

<span class="org-variable-name">env</span> = QT_QPA_PLATFORM,wayland
<span class="org-variable-name">env</span> = HYPRCURSOR_THEME,Breeze_Dark
<span class="org-variable-name">env</span> = HYPRCURSOR_SIZE,24

<span class="org-comment-delimiter"># </span><span class="org-comment">Set variables</span>
<span class="org-variable-name">monitor</span>=eDP-1,1920x1080@60,0x0,1
<span class="org-variable-name">$terminal</span> = footclient
<span class="org-variable-name">$menu</span> = fuzzel_run

</pre>
</div>
</div>
</div>

<div id="outline-container-orgf632970" class="outline-3">
<h3 id="orgf632970">keybinds.conf</h3>
<div class="outline-text-3" id="text-orgf632970">
<p>
This are my keybinds that I use the most, 
Here are some tips for the bind flags:
</p>
<div class="org-src-container">
<pre class="src src-example">Flags:

l -&gt; locked, aka. works also when an input inhibitor (e.g. a lockscreen) is active.
r -&gt; release, will trigger on release of a key.
e -&gt; repeat, will repeat when held.
n -&gt; non-consuming, key/mouse events will be passed to the active window in addition to triggering the dispatcher.
m -&gt; mouse, see below
t -&gt; transparent, cannot be shadowed by other binds.
i -&gt; ignore mods, will ignore modifiers.

bind(flag) = command
bindr = command
</pre>
</div>
</div>

<div id="outline-container-org0f96712" class="outline-4">
<h4 id="org0f96712">Main and most useful keybinds</h4>
<div class="outline-text-4" id="text-org0f96712">
<div class="org-src-container">
<pre class="src src-conf"><span class="org-comment-delimiter"># </span><span class="org-comment">[[ Keybinds ]]</span>

<span class="org-variable-name">$mainMod</span> = SUPER

<span class="org-comment-delimiter"># </span><span class="org-comment">Custom Keybinds.</span>
<span class="org-variable-name">bind</span> = $mainMod, return, exec, $terminal
<span class="org-variable-name">bindr</span>= $mainMod, D, exec, $menu
<span class="org-variable-name">bind</span> = $mainMod, w, exec, chromium
<span class="org-variable-name">bind</span> = SUPER_SHIFT, w, exec, webcam
      <span class="org-variable-name">bind</span> = ALT SHIFT, a, exec, toggle-animations
<span class="org-variable-name">bind</span> = $mainMod, f, exec, hyprctl dispatch togglefloating; pkill -SIGRTMIN+8 waybar <span class="org-comment-delimiter"># </span><span class="org-comment">hyprctl dispatch right in your script just so you can exec at the same time</span>
<span class="org-variable-name">bind</span> = $mainMod SHIFT, f, fullscreen, 
<span class="org-variable-name">bind</span> = SUPER_SHIFT, l, exec, swaylock
<span class="org-variable-name">bind</span> = $mainMod, q, killactive, 
<span class="org-variable-name">bind</span> = SUPER_SHIFT, q, exec, sysact 
<span class="org-variable-name">bind</span> = ,Print, exec, grimblast -n copy screen
<span class="org-variable-name">bind</span> = $mainMod SHIFT, r , exec, screencast
<span class="org-variable-name">bind</span> = $mainMod SHIFT, s, exec, grimblast -n copy area
<span class="org-variable-name">bind</span> = ALT,m , exec, pypr menu
<span class="org-variable-name">bind</span> = $mainMod SHIFT,Print, exec, shareurl.sh
<span class="org-variable-name">bind</span> = ALT SHIFT, Return , exec, pypr expose
<span class="org-variable-name">bind</span> = ,XF86PowerOff, exec, doas zzz -z

</pre>
</div>
</div>
</div>

<div id="outline-container-org3494880" class="outline-4">
<h4 id="org3494880">Keychords.</h4>
<div class="outline-text-4" id="text-org3494880">
<div class="org-src-container">
<pre class="src src-conf"><span class="org-comment-delimiter"># </span><span class="org-comment">[[ KeyChords ]]</span>
<span class="org-variable-name">bind</span> = $mainMod, SPACE , submap, menusubmap
<span class="org-variable-name">submap</span> = menusubmap
<span class="org-variable-name">bind</span> = ,i,exec,foot -e nsxiv ~/pics/classic/art -t -g 1500x700
<span class="org-variable-name">bind</span> = ,i,submap,reset
<span class="org-variable-name">bind</span> = ,m,exec,dmenumount
<span class="org-variable-name">bind</span> = ,m,submap,reset
<span class="org-variable-name">bind</span> = ,u,exec,dmenuumount
<span class="org-variable-name">bind</span> = ,u,submap,reset
<span class="org-variable-name">bind</span> = ,q,exec,sysact
<span class="org-variable-name">bind</span> = ,q,submap,reset
<span class="org-variable-name">bind</span>=,escape,submap,reset 
<span class="org-variable-name">submap</span> = reset

</pre>
</div>
</div>
</div>

<div id="outline-container-org302b9d5" class="outline-4">
<h4 id="org302b9d5">Window management.</h4>
<div class="outline-text-4" id="text-org302b9d5">
<div class="org-src-container">
<pre class="src src-conf"><span class="org-comment-delimiter"># </span><span class="org-comment">[[ Window management ]]</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Move focus with mainMod + arrow keys</span>
<span class="org-variable-name">bind</span> = $mainMod, J, layoutmsg,cyclenext
<span class="org-variable-name">bind</span> = $mainMod, K, layoutmsg,cycleprev

<span class="org-comment-delimiter"># </span><span class="org-comment">Swap windows</span>
<span class="org-variable-name">bind</span> = $mainMod SHIFT, J, swapnext, next
<span class="org-variable-name">bind</span> = $mainMod SHIFT, K, swapnext, prev

<span class="org-comment-delimiter"># </span><span class="org-comment">Resize windows</span>
<span class="org-variable-name">bind</span> = $mainMod, l, resizeactive, 40 0
<span class="org-variable-name">bind</span> = $mainMod, h, resizeactive, -40 0

<span class="org-comment-delimiter"># </span><span class="org-comment">Switch workspaces with mainMod + [0-9]</span>
<span class="org-variable-name">bind</span> = $mainMod, 1, workspace, 1
<span class="org-variable-name">bind</span> = $mainMod, 2, workspace, 2
<span class="org-variable-name">bind</span> = $mainMod, 3, workspace, 3
<span class="org-variable-name">bind</span> = $mainMod, 4, workspace, 4
<span class="org-variable-name">bind</span> = $mainMod, 5, workspace, 5
<span class="org-variable-name">bind</span> = $mainMod, 6, workspace, 6
<span class="org-variable-name">bind</span> = $mainMod, 7, workspace, 7
<span class="org-variable-name">bind</span> = $mainMod, 8, workspace, 8
<span class="org-variable-name">bind</span> = $mainMod, 9, workspace, 9
<span class="org-variable-name">bind</span> = $mainMod, 0, workspace, 10

<span class="org-comment-delimiter"># </span><span class="org-comment">Cycle through ocuped workspaces</span>
<span class="org-variable-name">bind</span> = ALT, Tab, workspace, m+1
<span class="org-variable-name">bind</span> = ALT SHIFT, Tab, workspace, m-1

<span class="org-comment-delimiter"># </span><span class="org-comment">Move active window to a workspace with mainMod + SHIFT + [0-9]</span>
<span class="org-variable-name">bind</span> = $mainMod SHIFT, 1, movetoworkspacesilent, 1
<span class="org-variable-name">bind</span> = $mainMod SHIFT, 2, movetoworkspacesilent, 2
<span class="org-variable-name">bind</span> = $mainMod SHIFT, 3, movetoworkspacesilent, 3
<span class="org-variable-name">bind</span> = $mainMod SHIFT, 4, movetoworkspacesilent, 4
<span class="org-variable-name">bind</span> = $mainMod SHIFT, 5, movetoworkspacesilent, 5
<span class="org-variable-name">bind</span> = $mainMod SHIFT, 6, movetoworkspacesilent, 6
<span class="org-variable-name">bind</span> = $mainMod SHIFT, 7, movetoworkspacesilent, 7
<span class="org-variable-name">bind</span> = $mainMod SHIFT, 8, movetoworkspacesilent, 8
<span class="org-variable-name">bind</span> = $mainMod SHIFT, 9, movetoworkspacesilent, 9
<span class="org-variable-name">bind</span> = $mainMod SHIFT, 0, movetoworkspacesilent, 10

<span class="org-comment-delimiter"># </span><span class="org-comment">Scroll through existing workspaces with mainMod + scroll</span>
<span class="org-variable-name">bind</span> = $mainMod, mouse_down, workspace, e+1
<span class="org-variable-name">bind</span> = $mainMod, mouse_up, workspace, e-1

<span class="org-comment-delimiter"># </span><span class="org-comment">Move/resize windows with mainMod + LMB/RMB and dragging</span>
<span class="org-variable-name">bindm</span> = $mainMod, mouse:272, movewindow
<span class="org-variable-name">bindm</span> = $mainMod, mouse:273, resizewindow

</pre>
</div>
</div>
</div>

<div id="outline-container-org24cf377" class="outline-4">
<h4 id="org24cf377">Media Keys</h4>
<div class="outline-text-4" id="text-org24cf377">
<div class="org-src-container">
<pre class="src src-conf"><span class="org-comment-delimiter"># </span><span class="org-comment">Audio MPC commands</span>
<span class="org-variable-name">bind</span> = ,XF86AudioPlay, exec, mpc toggle
<span class="org-variable-name">bind</span> = ,XF86AudioStop, exec, mpc stop
<span class="org-variable-name">bind</span> = ,XF86AudioNext, exec, mpc next
<span class="org-variable-name">bind</span> = ,XF86AudioPrev, exec, mpc prev
<span class="org-variable-name">binde</span> = , XF86AudioRaiseVolume, exec, wpctl set-volume -l 1.0 @DEFAULT_AUDIO_SINK@ 5%+
<span class="org-variable-name">binde</span> = , XF86AudioLowerVolume, exec, wpctl set-volume @DEFAULT_AUDIO_SINK@ 5%-
<span class="org-variable-name">bindl</span> = , XF86AudioMute, exec, wpctl set-mute @DEFAULT_AUDIO_SINK@ toggle

<span class="org-comment-delimiter"># </span><span class="org-comment">Screen Brightness</span>
<span class="org-variable-name">bind</span>=,XF86MonBrightnessUp,exec,doas brightnessctl set +10%
<span class="org-variable-name">bind</span>=,XF86MonBrightnessDown,exec,doas brightnessctl set 10%-

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4172984" class="outline-3">
<h3 id="org4172984">scratchpads.conf</h3>
<div class="outline-text-3" id="text-org4172984">
<p>
In order to make the scratchpads works, you need to install pyprland package through python pip package installation.
</p>

<div class="org-src-container">
<pre class="src src-shell">pip install pyprland
</pre>
</div>
</div>
