content/posts/my_hyprland_config.org
*** Pyprland
this is the config file for declare the plugins that are used within =pypr=.

#+begin_src toml
[pyprland]
plugins = [
  "scratchpads",
  "shortcuts_menu",
  "expose"
]

[scratchpads.term]
animation = "fromTop"
command = "foot -a term"
class = "term"
size = "75% 60%"
max_size = "1920px 100%"
margin = 50

[scratchpads.music_player]
animation = "fromRight"
command = "foot -a music_player -e ncmpcpp"
class = "music_player"
size = "75% 60%"
max_size = "1920px 100%"
margin = 50

[scratchpads.nnn]
animation = "fromLeft"
command = "foot -a nnn -e nnn"
class = "nnn"
size = "50% 40%"
position = "5% 10%"
max_size = "1920px 100%"
margin = 50

[scratchpads.fetch]
animation = "fromLeft"
command = "foot -a venom_fetch"
class = "venom_fetch"
size = "23% 48%"
position = "5% 10%"
max_size = "1920px 100%"
margin = 50


[shortcuts_menu]
engine = "fuzzel --dmenu"
# parameters = "-p '[prompt] 🍰 ' -dmenu -matching fuzzy -i"
command_start = "💀"

[shortcuts_menu.entries]

"Restart Waybar" = "pkill -9 waybar ; setsid waybar"
"Telegram" = "xdg-open https:/web.telegram.org/a/#-1421253041"
"Cinny" = "xdg-open https:/app.cinny.in/"

"Scratch" = [
  {name="action", options=["sync", "sysup" ]},
  "foot -e doas scratch [action]"
  ]
#+end_src

