posts/my_hyprland_config.html

<div id="outline-container-org877beed" class="outline-4">
<h4 id="org877beed">keybinds and rules.</h4>
<div class="outline-text-4" id="text-org877beed">
<p>
The structure that I use is the bind, and next the window rule, I have this window rules apart from the <code>window management configuration</code> because I want to keep the binds an rules in the same file.
</p>

<div class="org-src-container">
<pre class="src src-conf">  <span class="org-comment-delimiter"># </span><span class="org-comment">[[ Scratchpads rules ]]</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Keybind</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">window rules</span>

<span class="org-variable-name">bind</span> = $mainMod Shift,Return,exec,pypr toggle term
<span class="org-variable-name">$dropterm</span>  = (term)$
<span class="org-variable-name">windowrule</span> = float,$dropterm
<span class="org-variable-name">windowrule</span> = workspace special silent,$dropterm
<span class="org-variable-name">windowrule</span> = size 75% 60%,$dropterm

<span class="org-variable-name">bind</span> = ALT,Return,exec,pypr toggle fetch
<span class="org-variable-name">$fetch</span>  = (venom_fetch)$
<span class="org-variable-name">windowrule</span> = float,$fetch
<span class="org-variable-name">windowrule</span> = workspace special silent,$fetch
<span class="org-variable-name">windowrule</span> = size 75% 60%,$fetch

<span class="org-variable-name">bind</span> = $mainMod,m,exec,pypr toggle music_player
<span class="org-variable-name">$music_player</span>  = (music_player)$
<span class="org-variable-name">windowrule</span> = float,$music_player
<span class="org-variable-name">windowrule</span> = workspace special silent,$music_player
<span class="org-variable-name">windowrule</span> = size 75% 60%,$music_player

<span class="org-variable-name">bind</span> = $mainMod,e,exec,pypr toggle nnn
<span class="org-variable-name">$nnn</span>  = (nnn)$
<span class="org-variable-name">windowrule</span> = float,$nnn
<span class="org-variable-name">windowrule</span> = workspace special silent,$nnn
<span class="org-variable-name">windowrule</span> = size 75% 60%,$nnn

</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
